[
  {
    "id": "1764957760569",
    "title": "Tuning our racing kart at Penn State! ",
    "slug": "tuning-our-racing-kart-at-penn-state-1764957760569",
    "summary": " (FSAE) Formula Society of Automotive Engineers",
    "heroImage": "https://raw.githubusercontent.com/Ascendss/MBEngineering-main/main/assets/uploads/1764957758751-eb0029.png",
    "content": "To begin, its important to know what engine we're using--> we have the Honda cbr 600rr engine. with a 1-2-4-3 firing order. \n\n![image description](https://raw.githubusercontent.com/Ascendss/MBEngineering-main/main/assets/uploads/1764957487835-c8fee6.jpg)\n\n1.) I defined the engine configuration in Haltech NSP\n\n\n![image description](https://raw.githubusercontent.com/Ascendss/MBEngineering-main/main/assets/uploads/1764957693841-703b0b.png)\n\n\n\n",
    "createdAt": "2025-12-05T18:02:40.569Z"
  },
  {
    "id": "1765587057493",
    "title": "The common starting moves of Electrical Engineering",
    "slug": "the-common-starting-moves-of-electrical-engineering-1765587057493",
    "summary": "In chess, strong players do not start each game from scratch. They study opening books — collections of proven first moves that reliably lead to stable, playable positions. Electrical engineering is no different.",
    "heroImage": "https://raw.githubusercontent.com/Ascendss/MBEngineering-main/main/assets/uploads/1765587055932-b2dbe6.jpg",
    "content": "While products vary widely in purpose, form factor, and complexity, most successful electronic systems are built from a small set of recurring circuit strategies that appear again and again across industries.\n\nThis blog is an attempt to catalog those strategies.\n\nRather than focusing on isolated textbook problems or novelty circuits, the goal is to document the core electrical “moves” that nearly every real product uses: power entry and protection, voltage regulation, signal conditioning, amplification, filtering, conversion between analog and digital domains, and safe interaction with the outside world. These are the circuits that quietly underpin consumer electronics, industrial controls, medical devices, and instrumentation alike.\n\nOver time, this blog will form a practical “opening book” for electrical engineering — a reference for students, hobbyists, and early-career engineers who want to recognize proven patterns, avoid common mistakes, and understand how real products are constructed. The emphasis is on clarity, repeatability, and reasoning, not memorization.\n\nLets begin with power\n\n\n\n\n\n\n\n\n**Source Reference Design:\nTexas Instruments PMP21783 / PMP21783.2\n“60-W Ultra-Wide Range Isolated Flyback-Quasi Resonant Power Supply”\nSchematic, PCB layout, and documentation courtesy of Texas Instruments.\n**\n\n\n\n![image description](https://raw.githubusercontent.com/Ascendss/MBEngineering-main/main/assets/uploads/1765587915237-5e8a1b.png)\n\n![image description](https://raw.githubusercontent.com/Ascendss/MBEngineering-main/main/assets/uploads/1765587925451-326c48.png)\nFigure: Quasi-resonant isolated flyback power supply reference design\nSource: Texas Instruments, PMP21783 Reference Design\nhttps://www.ti.com/reference-designs\n\n\n![image description](https://raw.githubusercontent.com/Ascendss/MBEngineering-main/main/assets/uploads/1765588593579-cb87e8.png)\n\n\n\n\n\n\n**Move 1: Power Entry & Front End\nAC and DC Input Conditioning into a Common High-Voltage DC Bus**\n\nThe purpose of the power entry stage is to accept multiple real-world power sources and convert them into a single high-voltage DC bus suitable for the isolated flyback converter. In this design, Texas Instruments supports both 85–265 VAC and 24–150 VDC inputs by handling each input type separately and normalizing them early in the system.\n\n\n\n\n\n**Move 1A: AC Input Path (85–265 VAC)\nAC Input Connector and Fuse**\n\nJ2: AC line and neutral input connector\n\nF1: Line fuse\n\nThe AC mains enter the board through connector J2. The fuse F1 provides primary safety protection by opening under sustained overcurrent conditions. This protects downstream components and is required for any mains-powered design.\n\n\n\n\nEMI / Line Filter\n\nC13: X-class line capacitor\n\nL3: Common-mode choke\n\nAfter the fuse, the AC input passes through an EMI filter consisting of C13 and L3. This network reduces conducted electromagnetic interference in both directions:\n\nIt prevents high-frequency switching noise generated inside the power supply from returning to the AC mains.\n\nIt attenuates external line noise before it enters the system.\n\nThis block is critical for regulatory compliance (EMI/EMC).\n\nBridge Rectifier\n\nD8: Bridge rectifier (KBP06G)\n\nThe filtered AC waveform is rectified by D8, converting the bipolar AC input into a unipolar, pulsating DC waveform. After rectification, the voltage magnitude depends directly on the AC input level.\n\nFor the supported input range, the resulting DC voltage is approximately:\n\n~120 VDC at low line (85 VAC)\n\n~375 VDC at high line (265 VAC)\n\nBulk Energy Storage\n\nDownstream bulk capacitors (high-voltage electrolytics)\n\nBulk capacitors immediately following the bridge rectifier smooth the rectified waveform and store energy between AC line peaks. These capacitors supply the flyback converter during short line dropouts and reduce ripple on the high-voltage DC bus.\n\nAt this point, the AC input path has produced an unregulated high-voltage DC rail.\n\nMove 1B: DC Input Path (24–150 VDC)\nDC Input Connector\n\nJ1: 24–250 VDC input connector\n\nThe DC input enters through J1, supporting a wide DC voltage range. Unlike the AC path, this input may be too low to directly operate the flyback stage efficiently.\n\nDC Input Filtering and Sensing\n\nR1, R4, R5, R8: Input sensing and bias resistors\n\nC9, C30, C31: Input decoupling capacitors\n\nTP1: Test point on the DC input rail\n\nThese components provide:\n\nBasic filtering to reduce input noise\n\nVoltage sensing for control and protection functions\n\nLocal energy storage for transient current demands\n\nBoost Converter Stage (DC Input Only)\n\nQ1: Boost MOSFET\n\nL1: Boost inductor\n\nD1: High-speed boost diode\n\nC6, C5: Boost output capacitors\n\nBoost output labeled “Boost to 150 V”\n\nWhen the DC input voltage is below the required flyback operating range, the boost converter raises it to approximately 150 VDC. This allows the flyback stage to operate from a consistent input voltage, regardless of whether power originates from AC or DC.\n\nThis boost stage is bypassed when the input voltage is already sufficiently high.\n\nUnified High-Voltage DC Bus\n\nBoth the AC rectified output and the boosted DC input converge onto a common high-voltage DC bus that feeds the primary side of the flyback converter.\n\nKey architectural advantage:\n\nThe flyback stage sees a known voltage range\n\nControl complexity is isolated to the front end\n\nAC/DC dual-input support is achieved without duplicating the main power stage\n\nFrom this point forward, the remainder of the system does not distinguish between AC or DC input sources.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "createdAt": "2025-12-13T00:50:57.493Z",
    "updatedAt": "2025-12-13T04:07:15.313Z"
  },
  {
    "id": "1770838260025",
    "title": "ACT Quarterly Reviews",
    "slug": "act-quarterly-reviews-1770838260025",
    "summary": "What past employer's have said about me! ",
    "heroImage": "https://raw.githubusercontent.com/Ascendss/MBEngineering-main/main/assets/uploads/1770838377012-823864.png",
    "content": "Some quarters I did not recieve a review, so I've posted everything that ACT has given me feedback on professionally. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "createdAt": "2026-02-11T19:31:00.025Z",
    "updatedAt": "2026-02-11T20:37:41.185Z"
  }
]